{
  "skills": [
    "Frontend", "Backend", "Workflow"
  ],
  "socials": [
    {
      "name": "Twitter",
      "link": "//twitter.com/damarkov",
      "icon": "vk"
    },
    {
      "name": "GitHub",
      "link": "//github.com/DmitryMarkov",
      "icon": "github"
    },
    {
      "name": "Behance",
      "link": "//www.behance.net/damarkov",
      "icon": "in"
    }
  ],
  "nav": [
    {
      "name": "Мои работы",
      "url": "works.html"
    },
    {
      "name": "Обо мне",
      "url": "about.html"
    },
    {
      "name": "Блог",
      "url": "blog.html"
    },
    {
      "name": "Авторизация",
      "url": "login.html"
    }
  ],
  "articles": [
    {
      "name": "Софт для дизайнера",
      "hash": "first",
      "date": "2017-04-27",
      "content": "<p>Photoshop предоставляет огромное количество плагинов, которые могут облегчить ваш рабочий процесс, но мы рекомендуем использовать Sketch или Adobe XD. Эти программы совмещают преимущества использования векторной графики с простотой работы над растровыми изображениями, что особенно полезно при создании дизайна для устройств с большой плотностью пикселей. Используя Sketch или XD, вы не будете переживать о выбранных цветовых профилях, а размер рабочих файлов будет в разы меньше. В итоге вы получите много полезных функций, которые смогут ускорить рабочий процесс.</p><p>Google рекомендует использовать dash-нотацию для всех файлов, включая HTML, PDF и JPG. Вы можете посмотреть <a href='http://youtu.be/AQcSFsQyct8'>видео</a> Google Webmasters, в котором подробно объясняются причины такого выбора.</p>"
    },
    {
      "name": "Оптимизация изображений",
      "hash": "second",
      "date": "2017-04-27",
      "content": "<p>Дизайнеры в основном считают, что оптимизация изображений — задача разработчиков. С моей точки зрения, если вы хотите увидеть максимально точно реализованные макеты, не позволяйте разработчику принимать решения, связанные с визуальной частью. Например, это касается качества изображений и степени их сжатия.</p><p>При использовании SVG вы не будете волноваться о подготовке изображений для устройств с разной плотностью пикселей, создавая версии @2x и @3x. Также не придётся создавать версии одного файла с разрешениями для разных частей сайта (к примеру, логотип в футере и в шапке может быть разного размера, но с SVG вы будете использовать один файл). Другое преимущество SVG в том, что векторная графика занимает намного меньше места и является текстом, что позволяет эффективно производить сжатие на стороне сервера с помощью gzip для последующей передачи клиенту.</p><p class='accent'>Подумайте дважды, перед тем как отправлять файлы размером больше 1МБ разработчику.</p><p>Возможно несколько сценариев. Первый: разработчик не обратит на это внимание, что негативно скажется на скорости загрузки сайта. Второй: разработчик пережмёт изображение так, что появятся артефакты, ухудшится качество, или даже поменяется цветовой профиль. Не ленитесь и не перекладывайте свою работу на плечи разработчика, потому что именно вы ответственны за визуальное качество проекта.</p>"
    },
    {
      "name": "Самый необходимый набор Gulp плагинов",
      "hash": "third",
      "date": "2017-04-27",
      "content": "Самое важное...."
    },
    {
      "name": "Почему я выбрал Pug",
      "hash": "fouth",
      "date": "2017-04-27",
      "content": "Самое важное...."
    }
  ]
}
